/******************************************************************************
*  ASR => 4R2.04                                                              *
*******************************************************************************
*                                                                             *
*  N° de Sujet : 3                                                            *
*                                                                             *
*******************************************************************************
*                                                                             *
*  Intitulé :   Chiffrement de messages                                       *
*                                                                             *
*******************************************************************************
*                                                                             *
*  Nom-prénom1 : AUTRET Pierrick                                              *
*                                                                             *
*  Nom-prénom2 : GINER Clement                                                *
*                                                                             *
*  Nom-prénom3 :                                                              *
*                                                                             *
*  Nom-prénom4 :                                                              *
*                                                                             *
*******************************************************************************
*                                                                             *
*  Nom du fichier : vigenere.h                                                *
*                                                                             *
******************************************************************************/

#ifndef VIGENERE_H
#define VIGENERE_H

void chiffrer_vigenere(char *message, char *key);
void dechiffrer_vigenere(char *message, char *key);

#endif // VIGENERE_H
